app/controllers/personas_controller.rb

  def index
    @personas = Persona.all
---
SELECT * FROM "personas" WHERE ((tel_oficina ilike E'%55%' or tel_particular ilike E'%55%' or tel_movil ilike E'%55%' or tel_fax ilike E'%55%') )

  def show
    @persona = Persona.find(params[:id])
---
SELECT * FROM "personas" WHERE ("personas"."id" = 0)