app/controllers/secure_controller.rb

  def authenticate
		#User.new(params[:userform]) will create a new object of User, retrieve values from the form and store it variable @user.
		@user = User.new(params[:userform])
    #find records with username,password
		valid_user = User.find(:first,:conditions => ["user_name = ? and password = ?",@user.user_name, Digest::MD5.hexdigest(@user.password)])
---
SELECT * FROM "users" WHERE (user_name = E'admin' and password = E'22d6655f550c1837728b278981309e88') LIMIT 1