app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    valido = false
    if !@user.password.blank? and @user.password.length < 5
      @user.errors.add("password", ": Debe ser mayor a 5.")
      valido = false
    else

      if @user.password == params[:confirmacion]
        valido = true
        @user.password = Digest::MD5.hexdigest(@user.password)
      else
        @user.errors.add("password", ": Los passwords no coinciden.")
      end
    end

    respond_to do |format|
      if valido and @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "role", "user_name", "password") VALUES('2010-06-21 23:24:47.296646', '2010-06-21 23:24:47.296646', 1, E'abimael', E'30639aad3d494538ba4bf03899fcf79b') RETURNING "id"

  def update
    @user = User.find(params[:id])

    password = params[:password]
    valido = false
    if !password.blank? and password.length > 10
      @user.errors.add("password", ": Debe ser menor a 10.")
      valido = false
    else
      @user.password = password
      if @user.password == params[:confirmacion]
        valido = true
        @user.password = Digest::MD5.hexdigest(@user.password)
      else
        @user.errors.add("password", ": Los passwords no coinciden.")
      end
    end

    respond_to do |format|
      if valido and @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2011-06-15 01:58:20.589261', "password" = E'30639aad3d494538ba4bf03899fcf79b' WHERE "id" = 1